ka2_2024/src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал / ГО</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <comment>Доверенность налогоплательщика на представителя</comment>
      <type>
        <types>CatalogRef.ДоверенностиНалогоплательщика</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
      </type>
    </attributes>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УполномоченноеЛицоПредставителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставителя</name>
      <comment>Название документа, подтверждающего полномочия представителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/РегистрацияВНОКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуРедактированияПредставителей(Форма, АдресВременногоХранилищаПредставителей, ОписаниеОповещенияОЗакрытии) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВременногоХранилищаПредставителей", АдресВременногоХранилищаПредставителей);
	
	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.Форма.ФормаВыбораПредставителей", ПараметрыФормы, Форма, , , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

Процедура ДобавитьПодписанта(Форма, Объект) Экспорт
	
	ЗначенияЗаполнения = РегистрацияВНОКлиентСервер.ПараметрыПодписанта();
	ЗначенияЗаполнения.НесколькоПодписантов = Истина;
	ЗначенияЗаполнения.ЭтоДобавление = Истина;
	ЗначенияЗаполнения.Владелец = Объект.Владелец;
	
	ОткрытьФормуПредставителя(Форма, ЗначенияЗаполнения);

КонецПроцедуры

Процедура УдалитьПодписанта(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ТекущиеДанные = Элементы.Подписанты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	СтрокаДляУдаления = Форма.Подписанты.НайтиПоИдентификатору(Элементы.Подписанты.ТекущаяСтрока);
	Форма.Подписанты.Удалить(СтрокаДляУдаления);
	
КонецПроцедуры

Процедура ОткрытьФормуПредставителя(Форма, ЗначенияЗаполнения) Экспорт
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму(
		"Справочник.РегистрацииВНалоговомОргане.Форма.ФормаПредставителя", 
		ПараметрыФормы, 
		Форма, 
		ЗначенияЗаполнения);
	
КонецПроцедуры
	
Процедура ОтчетностьПодписываетПредставительПриИзменении(Форма, Объект) Экспорт

	Если Форма.ОтчетностьПодписываетПредставитель = 2 Тогда
		Форма.ПеренестиПодписантаИзШапкиВТаблицу();
		РегистрацияВНОКлиентСервер.ОчиститьПредставителя(Объект);
	Иначе
		Форма.Подписанты.Очистить();
	КонецЕсли;
	
	Форма.ПредыдущийВидПодписанта = Форма.ОтчетностьПодписываетПредставитель;
		
	РегистрацияВНОКлиентСервер.ИзменитьОформлениеПодписантов(Форма, Объект);
	
КонецПроцедуры

Процедура ОбработкаВыбораПодписантов(Форма, Объект, ВыбранноеЗначение) Экспорт

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Форма.Модифицированность = Истина;
		Если ВыбранноеЗначение.НесколькоПодписантов Тогда

			Отбор = Новый Структура();
			Отбор.Вставить("Пользователь", ВыбранноеЗначение.Пользователь);
			
			НайденныеСтроки = Форма.Подписанты.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() >= 1 И ВыбранноеЗначение.ЭтоДобавление Тогда
			
				ТекстОшибки = НСтр("ru = 'Пользователь %1 не может быть добавлен, поскольку уже есть в таблице подписантов.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ВыбранноеЗначение.Пользователь);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
			
			Если ВыбранноеЗначение.ЭтоДобавление Тогда
				Строка = Форма.Подписанты.Добавить();
			Иначе
				Строка = Форма.Подписанты.НайтиПоИдентификатору(ВыбранноеЗначение.ВыбраннаяСтрока);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Строка, ВыбранноеЗначение);
			РегистрацияВНОКлиентСервер.ЗаполнитьПредставлениеПодписанта(Строка);
			
		Иначе
			ЗаполнитьЗначенияСвойств(Форма,  ВыбранноеЗначение);
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
			Если ВыбранноеЗначение.Свойство("Представитель") Тогда
				Форма.ОтчетностьПодписываетПредставитель = ?(ЗначениеЗаполнено(Объект.Представитель), 1, 0);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	РегистрацияВНОКлиентСервер.ИзменитьОформлениеПодписантов(Форма, Объект);
	
КонецПроцедуры

Процедура ПодписантыВыбор(Форма, Объект, ВыбраннаяСтрока, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Подписанты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = РегистрацияВНОКлиентСервер.ПараметрыПодписанта();
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Объект);
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, ТекущиеДанные);
	ЗначенияЗаполнения.НесколькоПодписантов = Истина;
	ЗначенияЗаполнения.ВыбраннаяСтрока = ВыбраннаяСтрока;
	
	ОткрытьФормуПредставителя(Форма, ЗначенияЗаполнения);
	
КонецПроцедуры

Процедура ПредставлениеПредставителяНажатие(Форма, Объект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = РегистрацияВНОКлиентСервер.ПараметрыПодписанта();
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Объект);
	
	ОткрытьФормуПредставителя(Форма, ЗначенияЗаполнения);
	
КонецПроцедуры

#КонецОбласти
